Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: The actual content, defaults to a L<Mojo::Asset::Memory> object with L<Mojo::Asset::Memory/"auto_upgrade"> enabled.
ja: The actual content, defaults to a [[Mojo::Asset::Memory]] object with [[Mojo::Asset::Memory/"auto_upgrade"]] enabled.

source: The application object can be accessed via C<$app> or the C<app> function, L<strict>, L<warnings>, L and Perl 5.10 L<features|feature> are automatically enabled.
ja: The application object can be accessed via C<$app> or the C<app> function, [[strict]], [[warnings]], [[utf8]] and Perl 5.10 [[features|feature]] are automatically enabled.

source: The application object you can access with the function L</"app"> is the first argument passed to the C<startup> method.
ja: The application object you can access with the function [[/"app"]] is the first argument passed to the C<startup> method.

source: The attribute L<Mojolicious/"routes"> contains a router you can use to generate route structures.
ja: The attribute [[Mojolicious/"routes"]] contains a router you can use to generate route structures.

source: The callback passed to L<Mojo::UserAgent/"get"> will be executed once the request to the backend web service has been finished, this is called continuation-passing style.
ja: The callback passed to [[Mojo::UserAgent/"get"]] will be executed once the request to the backend web service has been finished, this is called continuation-passing style.

source: The callback will receive either a L<Mojo::Transaction::WebSocket> or L<Mojo::Transaction::HTTP> object, depending on if the handshake was successful.
ja: The callback will receive either a [[Mojo::Transaction::WebSocket]] or [[Mojo::Transaction::HTTP]] object, depending on if the handshake was successful.

source: The command L<Mojolicious::Command::Author::inflate> will write all templates and static files from the C<DATA> section into actual files in the C<templates> and C<public> directories.
ja: The command [[Mojolicious::Command::Author::inflate]] will write all templates and static files from the C<DATA> section into actual files in the C<templates> and C<public> directories.

source: The command L<Mojolicious::Command::routes> can be used from the command line to list all available routes together with names and underlying regular expressions.
ja: The command [[Mojolicious::Command::routes]] can be used from the command line to list all available routes together with names and underlying regular expressions.

source: The compilation of templates to Perl code can make debugging a bit tricky, but L<Mojo::Template> will return L<Mojo::Exception> objects that stringify to error messages with context.
ja: The compilation of templates to Perl code can make debugging a bit tricky, but [[Mojo::Template]] will return [[Mojo::Exception]] objects that stringify to error messages with context.

source: The connection gets established when you respond to the WebSocket handshake request with a C<101> response status, which happens automatically if you subscribe to an event with L<Mojolicious::Controller/"on"> or send a message with L<Mojolicious::Controller/"send"> right away.
ja: The connection gets established when you respond to the WebSocket handshake request with a C<101> response status, which happens automatically if you subscribe to an event with [[Mojolicious::Controller/"on"]] or send a message with [[Mojolicious::Controller/"send"]] right away.

source: The default format is C<html>, and restrictive placeholders can be used to limit possible values.
ja: デフォルトのフォーマットは C<html>です。プレースホルダで制限すれば、取りうる値を限定できます。

source: The default operating mode will usually be C<development> and can be changed with command line options or the C<MOJO_MODE> and C<PLACK_ENV> environment variables.
ja: デフォルトの処理モードは通常 C<development>ですが、コマンドラインオプションか C<MOJO_MODE>あるいはC<PLACK_ENV>環境変数によって変更することもできます。

source: The drain callback passed to L<Mojo::Content/"write"> will be executed whenever the entire previous chunk of data has actually been written.
ja: The drain callback passed to [[Mojo::Content/"write"]] will be executed whenever the entire previous chunk of data has actually been written.

source: The easiest way to embed one application into another is L<Mojolicious::Plugin::Mount>, which allows you to mount whole self-contained applications under a domain and/or prefix.
ja: The easiest way to embed one application into another is [[Mojolicious::Plugin::Mount]], which allows you to mount whole self-contained applications under a domain and/or prefix.

source: The event L<Mojo::Content/"read"> will be emitted for every chunk of data that is received, even chunked transfer encoding and gzip content encoding will be handled transparently if necessary.
ja: The event [[Mojo::Content/"read"]] will be emitted for every chunk of data that is received, even chunked transfer encoding and gzip content encoding will be handled transparently if necessary.

source: The event L<Mojo::Log/"message"> will be emitted for every new log message and the event L<Mojo::Transaction/"finish"> right after the transaction has been finished.
ja: The event [[Mojo::Log/"message"]] will be emitted for every new log message and the event [[Mojo::Transaction/"finish"]] right after the transaction has been finished.

source: The event L<Mojo::Transaction::WebSocket/"finish"> will be emitted right after the WebSocket connection has been closed.
ja: The event [[Mojo::Transaction::WebSocket/"finish"]] will be emitted right after the WebSocket connection has been closed.

source: The event loop will be resilient to time jumps if a monotonic clock is available through L<Time::HiRes>.
ja: The event loop will be resilient to time jumps if a monotonic clock is available through [[Time::HiRes]].

source: The first argument passed to all actions (C<$c>) is a L<Mojolicious::Controller> object, containing both the HTTP request and response.
ja: すべてのアクション（C<$self>）に渡される第一引数は、[[Mojolicious::Controller]]のインスタンスです。これにはHTTPリクエストとレスポンスが含まれています。

source: The following mission statement and rules are the foundation of all L<Mojo> and L<Mojolicious> development.
ja: The following mission statement and rules are the foundation of all [[Mojo]] and [[Mojolicious]] development.

source: The following plugins are included in the L<Mojolicious> distribution as examples.
ja: The following plugins are included in the [[Mojolicious]] distribution as examples.

source: The functions L</"get">, L</"post"> and friends all have equivalent methods.
ja: The functions [[/"get"]], [[/"post"]] and friends all have equivalent methods.

source: The generated hash of a matching route is actually the center of the whole L<Mojolicious> request cycle.
ja: The generated hash of a matching route is actually the center of the whole [[Mojolicious]] request cycle.

source: The global L<Mojo::IOLoop> singleton, used to access a single shared event loop object from everywhere inside the process.
ja: The global [[Mojo::IOLoop]] singleton, used to access a single shared event loop object from everywhere inside the process.

source: The heart of every L<Mojolicious> application, calls the L</"static"> and L</"routes"> dispatchers for every request and passes them a L<Mojolicious::Controller> object.
ja: The heart of every [[Mojolicious]] application, calls the [[/"static"]] and [[/"routes"]] dispatchers for every request and passes them a [[Mojolicious::Controller]] object.

source: The helper L<Mojolicious::Plugin::DefaultHelpers/"content_for"> allows you to pass whole blocks of content from one template to another.
ja: The helper [[Mojolicious::Plugin::DefaultHelpers/"content_for"]] allows you to pass whole blocks of content from one template to another.

source: The helpers L<Mojolicious::Plugin::DefaultHelpers/"flash"> and L<Mojolicious::Plugin::DefaultHelpers/"redirect_to"> are often used together to prevent double form submission, allowing users to receive a confirmation message that will vanish if they decide to reload the page they've been redirected to.
ja: The helpers [[Mojolicious::Plugin::DefaultHelpers/"flash"]] and [[Mojolicious::Plugin::DefaultHelpers/"redirect_to"]] are often used together to prevent double form submission, allowing users to receive a confirmation message that will vanish if they decide to reload the page they've been redirected to.

source: The home directory of your application, defaults to a L<Mojo::Home> object which stringifies to the actual path.
ja: The home directory of your application, defaults to a [[Mojo::Home]] object which stringifies to the actual path.

source: The hook L<Mojolicious/"before_render"> can be used to make stash values like C<storable> special, so that they no longer require a C<handler> value to be set explicitly.
ja: The hook [[Mojolicious/"before_render"]] can be used to make stash values like C<storable> special, so that they no longer require a C<handler> value to be set explicitly.

source: The hook L<Mojolicious/"before_render"> makes even more advanced customizations possible by allowing you to intercept and modify the arguments passed to the renderer.
ja: The hook [[Mojolicious/"before_render"]] makes even more advanced customizations possible by allowing you to intercept and modify the arguments passed to the renderer.

source: The idea behind L<Mojo::IOLoop::Delay> is to turn the nested closures above into a flat series of closures.
ja: The idea behind [[Mojo::IOLoop::Delay]] is to turn the nested closures above into a flat series of closures.

source: The limit is around 256KiB by default, you can use the attribute L<Mojo::Content/"max_buffer_size"> or C<MOJO_MAX_BUFFER_SIZE> environment variable to change this value.
ja: The limit is around 256KiB by default, you can use the attribute [[Mojo::Content/"max_buffer_size"]] or C<MOJO_MAX_BUFFER_SIZE> environment variable to change this value.

source: The limit is 8KiB by default, you can use the attribute L<Mojo::Message/"max_line_size"> or C<MOJO_MAX_LINE_SIZE> environment variable to change this value.
ja: The limit is 8KiB by default, you can use the attribute [[Mojo::Message/"max_line_size"]] or C<MOJO_MAX_LINE_SIZE> environment variable to change this value.

source: The limits are 100 headers with 8KiB each by default, you can use the attributes L<Mojo::Headers/"max_lines"> and L<Mojo::Headers/"max_line_size"> or the C<MOJO_MAX_LINES> and C<MOJO_MAX_LINE_SIZE> environment variables to change these values.
ja: The limits are 100 headers with 8KiB each by default, you can use the attributes [[Mojo::Headers/"max_lines"]] and [[Mojo::Headers/"max_line_size"]] or the C<MOJO_MAX_LINES> and C<MOJO_MAX_LINE_SIZE> environment variables to change these values.

source: The logging layer of your application, defaults to a L<Mojo::Log> object.
ja: The logging layer of your application, defaults to a [[Mojo::Log]] object.

source: The method L<Mojolicious::Controller/"param"> is used to access query parameters, C<POST> parameters, file uploads and route placeholders, all at once.
ja: The method [[Mojolicious::Controller/"param"]] is used to access query parameters, C<POST> parameters, file uploads and route placeholders, all at once.

source: The new manager will automatically send a L</"QUIT"> signal to the old manager and take over serving requests after starting up successfully.
ja: The new manager will automatically send a [[/"QUIT"]] signal to the old manager and take over serving requests after starting up successfully.

source: The next assertion, C<message_ok>, blocks (using the L<Mojo::IOLoop> singleton in the application) and waits for a response from the server.
ja: The next assertion, C<message_ok>, blocks (using the [[Mojo::IOLoop]] singleton in the application) and waits for a response from the server.

source: The options C<-h>/C<--help>, C<--home> and C<-m>/C<--mode> are handled automatically by L<Mojolicious::Commands> and are shared by all commands.
ja: The options C<-h>/C<--help>, C<--home> and C<-m>/C<--mode> are handled automatically by [[Mojolicious::Commands]] and are shared by all commands.

source: The original handshake transaction, usually a L<Mojo::Transaction::HTTP> object.
ja: The original handshake transaction, usually a [[Mojo::Transaction::HTTP]] object.

source: The parent of this route, usually a L<Mojolicious::Routes::Route> object.
ja: The parent of this route, usually a [[Mojolicious::Routes::Route]] object.

source: The plugin L<Mojolicious::Plugin::Mount> uses this functionality to allow you to combine multiple applications into one and deploy them together.
ja: The plugin [[Mojolicious::Plugin::Mount]] uses this functionality to allow you to combine multiple applications into one and deploy them together.

source: The plugin manager, defaults to a L<Mojolicious::Plugins> object.
ja: The plugin manager, defaults to a [[Mojolicious::Plugins]] object.

source: The renderer can be manually started by calling the method L<Mojolicious::Controller/"render">, but that's usually not necessary, because it will get automatically called if nothing has been rendered after the router finished its work.
ja: The renderer can be manually started by calling the method [[Mojolicious::Controller/"render"]], but that's usually not necessary, because it will get automatically called if nothing has been rendered after the router finished its work.

source: The return values of the first callback and exceptions thrown by it, will be serialized with L<Storable>, so they can be shared between processes.
ja: The return values of the first callback and exceptions thrown by it, will be serialized with [[Storable]], so they can be shared between processes.

source: The root of the route structure, usually a L<Mojolicious::Routes> object.
ja: The root of the route structure, usually a [[Mojolicious::Routes]] object.

source: The route endpoint that matched, usually a L<Mojolicious::Routes::Route> object.
ja: The route endpoint that matched, usually a [[Mojolicious::Routes::Route]] object.

source: The router allows many different route variations, L<Mojolicious::Guides::Routing> explains them all in great detail.
ja: The router allows many different route variations, [[Mojolicious::Guides::Routing]] explains them all in great detail.

source: The router, defaults to a L<Mojolicious::Routes> object.
ja: The router, defaults to a [[Mojolicious::Routes]] object.

source: The special configuration value C<config_override> will be set in L<Mojolicious/"config"> as well, which is used to disable configuration plugins like L<Mojolicious::Plugin::Config> and L<Mojolicious::Plugin::JSONConfig> for tests.
ja: The special configuration value C<config_override> will be set in [[Mojolicious/"config"]] as well, which is used to disable configuration plugins like [[Mojolicious::Plugin::Config]] and [[Mojolicious::Plugin::JSONConfig]] for tests.

source: The stash or helpers like L<Mojolicious::Plugin::DefaultHelpers/"title"> can be used to pass additional data to the layout.
ja: スタッシュや[[Mojolicious::Plugin::DefaultHelpers]]のC<title>のようなヘルパーを使うと、追加のデータをレイアウトに渡せます。

source: The strength of L<Mojolicious> comes from its varied community, people from a wide range of backgrounds.
ja: The strength of [[Mojolicious]] comes from its varied community, people from a wide range of backgrounds.

source: The template can be configured with L</"template">.
ja: The template can be configured with [[/"template"]].

source: The transaction that is currently being processed, usually a L<Mojo::Transaction::HTTP> or L<Mojo::Transaction::WebSocket> object.
ja: The transaction that is currently being processed, usually a [[Mojo::Transaction::HTTP]] or [[Mojo::Transaction::WebSocket]] object.

source: The tutorial introduces the L<Mojolicious::Lite> micro web framework, which is only a thin wrapper around the full web framework.
ja: The tutorial introduces the [[Mojolicious::Lite]] micro web framework, which is only a thin wrapper around the full web framework.

source: Then because we're expecting a JSON document back, we can leverage C<json_message_ok> which parses the WebSocket response body and returns an object we can access through L<Mojo::JSON::Pointer> syntax.
ja: Then because we're expecting a JSON document back, we can leverage C<json_message_ok> which parses the WebSocket response body and returns an object we can access through [[Mojo::JSON::Pointer]] syntax.

source: There are already shortcuts for the most common HTTP request methods like L<Mojolicious::Routes::Route/"post">, and for more control L<Mojolicious::Routes::Route/"any"> accepts an optional array reference with arbitrary request methods as first argument.
ja: There are already shortcuts for the most common HTTP request methods like [[Mojolicious::Routes::Route/"post"]], and for more control [[Mojolicious::Routes::Route/"any"]] accepts an optional array reference with arbitrary request methods as first argument.

source: There are many useful methods L<Mojo::Home> inherits from L<Mojo::File>, like L<Mojo::File/"child"> and L<Mojo::File/"slurp">, that will help you keep your application portable across many different operating systems.
ja: [[Mojo::Home]] には [[Mojo::File]]から継承した便利なメソッドがたくさんあります。たとえば、[[Mojo::File]]のC<child>やC<slurp>は、アプリケーションを様々なオペレーティングシステムにまたがって使用できるようにしています。

source: There are many variations of this error, but most of them mean that TLS certificate verification in L<Mojo::UserAgent> failed.
ja: There are many variations of this error, but most of them mean that TLS certificate verification in [[Mojo::UserAgent]] failed.

source: There are many ways in which you can help us resolve existing issues on the L<GitHub issue tracker|https://github.com/mojolicious/mojo/issues>.
ja: There are many ways in which you can help us resolve existing issues on the [[GitHub issue tracker|https://github.com/mojolicious/mojo/issues]].

source: There are many ways to contribute to L<Mojolicious>, this guide will show you a few of them.
ja: There are many ways to contribute to [[Mojolicious]], this guide will show you a few of them.

source: There is one big difference though, by calling it manually you can make sure that templates use the current controller object, and not the default controller specified with the attribute L<Mojolicious/"controller_class">.
ja: There is one big difference though, by calling it manually you can make sure that templates use the current controller object, and not the default controller specified with the attribute [[Mojolicious/"controller_class"]].

source: Therefore when installing or upgrading L<Mojolicious> and when running its tests, we highly recommend using an environment which does not set these variables.
ja: Therefore when installing or upgrading [[Mojolicious]] and when running its tests, we highly recommend using an environment which does not set these variables.

source: Therefore we ask that you please not publically fork pieces of the L<Mojolicious> distribution without our consent.
ja: Therefore we ask that you please not publically fork pieces of the [[Mojolicious]] distribution without our consent.

source: These mappings can be easily extended or changed with L<Mojolicious/"types">.
ja: These mappings can be easily extended or changed with [[Mojolicious/"types"]].

source: These modules are not part of the L<Mojolicious> distribution, but have been designed to be used with it and are being developed under the same umbrella.
ja: These modules are not part of the [[Mojolicious]] distribution, but have been designed to be used with it and are being developed under the same umbrella.

source: They can be especially useful for manually matching file names with extensions, rather than using L<format detection|/"Formats">.
ja: They can be especially useful for manually matching file names with extensions, rather than using [[format detection|/"Formats"]].

source: They have a higher precedence than templates in the C<DATA> section.
ja: これらはC<DATA>セクションにあるテンプレートよりも優先されます。

source: They work just like normal plugins and are also subclasses of L<Mojolicious::Plugin>.
ja: They work just like normal plugins and are also subclasses of [[Mojolicious::Plugin]].

source: This includes all helpers from L<Mojolicious::Plugin::DefaultHelpers> and L<Mojolicious::Plugin::TagHelpers>.
ja: This includes all helpers from [[Mojolicious::Plugin::DefaultHelpers]] and [[Mojolicious::Plugin::TagHelpers]].

source: This allows L<Mojolicious::Controller/"url_for"> for example, to generate portable URLs based on the current environment.
ja: This allows [[Mojolicious::Controller/"url_for"]] for example, to generate portable URLs based on the current environment.

source: This allows L<Mojolicious> to automatically pick up the C<X-Forwarded-For> and C<X-Forwarded-Proto> headers.
ja: This allows [[Mojolicious]] to automatically pick up the C<X-Forwarded-For> and C<X-Forwarded-Proto> headers.

source: This allows for example, the use of the L<Mojolicious::Lite> domain specific language in normal L<Mojolicious> controllers.
ja: This allows for example, the use of the [[Mojolicious::Lite]] domain specific language in normal [[Mojolicious]] controllers.

source: This code of conduct applies to all spaces managed by the L<Mojolicious> project.
ja: This code of conduct applies to all spaces managed by the [[Mojolicious]] project.

source: This document contains a simple and fun introduction to the L<Mojolicious> router and its underlying concepts.
ja: This document contains a simple and fun introduction to the [[Mojolicious]] router and its underlying concepts.

source: This document contains answers for the most frequently asked questions about L<Mojolicious>.
ja: This document contains answers for the most frequently asked questions about [[Mojolicious]].

source: This document contains many fun recipes for cooking with L<Mojolicious>.
ja: This document contains many fun recipes for cooking with [[Mojolicious]].

source: This document explains content generation with the L<Mojolicious> renderer.
ja: This document explains content generation with the [[Mojolicious]] renderer.

source: This document explains the process of starting a L<Mojolicious::Lite> prototype from scratch and growing it into a well-structured L<Mojolicious> application.
ja: This document explains the process of starting a [[Mojolicious::Lite]] prototype from scratch and growing it into a well-structured [[Mojolicious]] application.

source: This document is an introduction to testing web applications with L<Test::Mojo>.
ja: This document is an introduction to testing web applications with [[Test::Mojo]].

source: This enables us to get deep test coverage of L<Mojolicious>-based applications.
ja: This enables us to get deep test coverage of [[Mojolicious]]-based applications.

source: This error message usually appears after waiting for the results of a non-blocking operation for longer periods of time, because the underlying connection has been closed in the meantime and the value of the attribute L<Mojolicious::Controller/"tx"> is no longer available.
ja: This error message usually appears after waiting for the results of a non-blocking operation for longer periods of time, because the underlying connection has been closed in the meantime and the value of the attribute [[Mojolicious::Controller/"tx"]] is no longer available.

source: This gives us the necessary freedom to ensure a healthy future for L<Mojolicious>.
ja: This gives us the necessary freedom to ensure a healthy future for [[Mojolicious]].

source: This has already been done for all attributes and methods from L<Mojolicious::Controller>.
ja: This has already been done for all attributes and methods from [[Mojolicious::Controller]].
